apache/nuttx/arch/arm/src/common/stm32/stm32_comp_m3m4_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_comp_m3m4_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <assert.h>

#include <nuttx/analog/comp.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_comp.h"
#include "stm32_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some COMP peripheral must be enabled */

/* Up to 7 comparators in STM32F3 Series */

#if defined(CONFIG_STM32_COMP1) || defined(CONFIG_STM32_COMP2) || \
    defined(CONFIG_STM32_COMP3) || defined(CONFIG_STM32_COMP4) || \
    defined(CONFIG_STM32_COMP5) || defined(CONFIG_STM32_COMP6) || \
    defined(CONFIG_STM32_COMP7)

#ifndef CONFIG_STM32_SYSCFG
#  error "SYSCFG clock enable must be set"
#endif

/* @TODO: support for STM32F30XX and STM32F37XX comparators */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX) || \
    defined(CONFIG_STM32_STM32F37XX)

/* Currently only STM32F33XX supported */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F37XX)
#  error "Not supported yet"
#endif

#if defined(CONFIG_STM32_STM32F33XX)
#  if defined(CONFIG_STM32_COMP1) || defined(CONFIG_STM32_COMP3) || \
      defined(CONFIG_STM32_COMP5) || defined(CONFIG_STM32_COMP7)
#    error "STM32F33 supports only COMP2, COMP4 and COMP6"
#  endif
#endif

/* COMP2 default configuration **********************************************/

#ifdef CONFIG_STM32_COMP2
#  ifndef COMP2_BLANLKING
#    define COMP2_BLANKING COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP2_POL
#    define COMP2_POL COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP2_INM
#    define COMP2_INM COMP_INM_DEFAULT
#  endif
#  ifndef COMP2_OUTSEL
#    define COMP2_OUTSEL COMP_OUTSEL_DEFAULT
#  endif
#  ifndef COMP2_LOCK
#    define COMP2_LOCK COMP_LOCK_DEFAULT
#  endif
#  ifndef GPIO_COMP2_INM
#    warning "GPIO_COMP2_INM not selected. Set default value to GPIO_COMP2_INM1"
#    define GPIO_COMP2_INM GPIO_COMP2_INM_1
#  endif
#endif

/* COMP4 default configuration **********************************************/

#ifdef CONFIG_STM32_COMP4
#  ifndef COMP4_BLANLKING
#    define COMP4_BLANKING COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP4_POL
#    define COMP4_POL COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP4_INM
#    define COMP4_INM COMP_INM_DEFAULT
#  endif
#  ifndef COMP4_OUTSEL
#    define COMP4_OUTSEL COMP_OUTSEL_DEFAULT
#  endif
#  ifndef COMP4_LOCK
#    define COMP4_LOCK COMP_LOCK_DEFAULT
#  endif
#  ifndef GPIO_COMP4_INM
#    warning "GPIO_COMP4_INM not selected. Set default value to GPIO_COMP4_INM1"
#    define GPIO_COMP4_INM GPIO_COMP4_INM_1
#  endif
#endif

/* COMP6 default configuration **********************************************/

#ifdef CONFIG_STM32_COMP6
#  ifndef COMP6_BLANLKING
#    define COMP6_BLANKING COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP6_POL
#    define COMP6_POL COMP_BLANKING_DEFAULT
#  endif
#  ifndef COMP6_INM
#    define COMP6_INM COMP_INM_DEFAULT
#  endif
#  ifndef COMP6_OUTSEL
#    define COMP6_OUTSEL COMP_OUTSEL_DEFAULT
#  endif
#  ifndef COMP6_LOCK
#    define COMP6_LOCK COMP_LOCK_DEFAULT
#  endif
#  ifndef GPIO_COMP6_INM
#    warning "GPIO_COMP6_INM not selected. Set default value to GPIO_COMP6_INM1"
#    define GPIO_COMP6_INM GPIO_COMP6_INM_1
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the configuration of one COMP device */

struct stm32_comp_s
{
  uint8_t blanking;             /* Blanking source */
  uint8_t pol;                  /* Output polarity */
  uint8_t inm;                  /* Inverting input selection */
  uint8_t out;                  /* Comparator output */
  uint8_t lock;                 /* Comparator Lock */
  uint32_t csr;                 /* Control and status register */
#ifndef CONFIG_STM32_STM32F33XX
  uint8_t mode;                 /* Comparator mode */
  uint8_t hyst;                 /* Comparator hysteresis */
                                /* @TODO: Window mode + INP selection */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* COMP Register access */

static inline void comp_modify_csr(struct stm32_comp_s *priv,
                                   uint32_t clearbits, uint32_t setbits);
static inline uint32_t comp_getreg_csr(struct stm32_comp_s *priv);
static inline void comp_putreg_csr(struct stm32_comp_s *priv,
                                   uint32_t value);
static bool stm32_complock_get(struct stm32_comp_s *priv);
static int stm32_complock(struct stm32_comp_s *priv, bool lock);

/* COMP Driver Methods */

static void comp_shutdown(struct comp_dev_s *dev);
static int comp_setup(struct comp_dev_s *dev);
static int comp_read(struct comp_dev_s *dev);
static int comp_ioctl(struct comp_dev_s *dev, int cmd,
                      unsigned long arg);

/* Initialization */

static int stm32_compconfig(struct stm32_comp_s *priv);
static int stm32_compenable(struct stm32_comp_s *priv, bool enable);

/****************************************************************************
 * Private Data
 ****************************************************************************/

